 ##  1.Create a data frame with 4 columns 4 rows

In [17]:
import pandas as pd
import numpy as n
d=[[10,20,30,43],[40,50,60,89],[25,35,45,74],[32,43,65,56]]
d1=pd.DataFrame(a,index=["a","b","c","d"],columns=["w","x","y","z"])
d1

    w   x   y   z
a  10  20  30  43
b  40  50  60  89
c  25  35  45  74
d  32  43  65  56

## 2.print all Columns form your data frame

In [19]:
d1.columns()

TypeError: 'Index' object is not callable

In [22]:
d1.loc[:]

    w   x   y   z
a  10  20  30  43
b  40  50  60  89
c  25  35  45  74
d  32  43  65  56

## 3.print all rows from your data frame

In [27]:
d1.loc[:,["w","x","y","z"]]

    w   x   y   z
a  10  20  30  43
b  40  50  60  89
c  25  35  45  74
d  32  43  65  56

## 4.print Second column in your data frame

In [37]:
d1.loc[:,["x"]]

    x
a  20
b  50
c  35
d  43

## 5.print last 2 columns from your data Frame

In [39]:
d1.loc[:,["y","z"]]

    y   z
a  30  43
b  60  89
c  45  74
d  65  56

## 6.print fourth row from your data Frame

In [45]:
d1.loc[["d"]]

    w   x   y   z
d  32  43  65  56

## 7.print first 2 Rows from your data Frame

In [47]:
d1.loc[["a","b"]]

    w   x   y   z
a  10  20  30  43
b  40  50  60  89

## 8.print all rows and first 2 columns from your data Frame

In [53]:
d1.loc[["a","b","c","d"]]
d1.loc[:,["w","x"]]

    w   x
a  10  20
b  40  50
c  25  35
d  32  43

## 9.Delete any row from your data Frame

In [55]:
d1.drop("c")

    w   x   y   z
a  10  20  30  43
b  40  50  60  89
d  32  43  65  56

## 10.Delete any column from your data Frame

In [66]:
d1.pop("z")

a    43
b    89
c    74
d    56
Name: z, dtype: int64

## 11.Add a column to a Data Frame

In [70]:
new=[22,43,78,90]
d1['s']=new
print(pd.DataFrame(d1))

    w   x   y   s
a  10  20  30  22
b  40  50  60  43
c  25  35  45  78
d  32  43  65  90

## 12.Add a row to a Data Frame

In [81]:
new={"w":90,"x":87,"y":67,"s":54}
r=pd.DataFrame(new,index=['p'])
d1=pd.concat([r,d1])
print(d1)

    w   x   y   s
p  90  87  67  54
a  10  20  30  22
b  40  50  60  43
c  25  35  45  78
d  32  43  65  90

## 13.Iterate all Columns in your Data Frame and print result

In [78]:
for i in iter(d1):
    print(i)

w
x
y
s

## 14.Iterate the 3rd column values of your Data frame and print result.

In [82]:
s=d1.pop("y")
for i in iter(s):
    print(i)

67
30
60
45
65

## 15.Iterate all Rows in your Data Frame and print result.

In [85]:
for i in d1.iterrows():
    print(i)

('p', w    90
x    87
s    54
Name: p, dtype: int64)
('a', w    10
x    20
s    22
Name: a, dtype: int64)
('b', w    40
x    50
s    43
Name: b, dtype: int64)
('c', w    25
x    35
s    78
Name: c, dtype: int64)
('d', w    32
x    43
s    90
Name: d, dtype: int64)

## 16.Read income.csv file and print as Data Frame

In [88]:
##read a csv file
file="income.csv"
import pandas as pd
d=pd.read_csv(file)
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

## 17.Delete 2006 column info from your data Frame by using drop

In [92]:
d.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528